// ======================
// GLOBAL STATE
// ======================

let isVip = false
let isX2 = false
let currentTab = "solo"

let taskState = {
    solo: [],
    pair: [],
    faction: []
}

let timers = []

// ======================
// TASK LIST
// ======================

const tasks = {
    solo: [
        { name: "Посетить сайт", bp: 1 },
        { name: "Зайти в канал Brawl", bp: 1 },
        { name: "Лотерея", bp: 1 },
        { name: "Лайк в Match", bp: 1 },
        { name: "Кейс за DP", bp: 10 },
        { name: "Броски питомцу 15", bp: 2 },
        { name: "Команды питомца 15", bp: 2 },
        { name: "Киностудия", bp: 2 },
        { name: "Тир", bp: 1 },
        { name: "Кинотеатр 5", bp: 1 },
        { name: "Баскетбол 2", bp: 1 },
        { name: "Футбол 2", bp: 1 },
        { name: "Волейбол 1мин", bp: 1 },
        { name: "Настольный теннис 1мин", bp: 1 },
        { name: "Большой теннис 1мин", bp: 1 },
        { name: "Колесо удачи", bp: 3 },
        { name: "Автосервис (своё)", bp: 1 },
        { name: "Починить чужое авто", bp: 2 },
        { name: "Автобус 2", bp: 2 },
        { name: "Стройка 25", bp: 2 },
        { name: "Порт 25", bp: 2 },
        { name: "Шахта 25", bp: 2 },
        { name: "Метро", bp: 2 },
        { name: "Дартс", bp: 1 },
        { name: "Ферма 10", bp: 1 },
        { name: "Рыбалка 20", bp: 4 },
        { name: "Дальнобойщик 4", bp: 2 },
        { name: "Сокровище", bp: 1 },
        { name: "Охота 5", bp: 2 },
        { name: "Тренажерный зал 20", bp: 1 },
        { name: "Квесты клуба 2", bp: 4 },
        { name: "Пожарный 25", bp: 1 },
        { name: "Нули в казино", bp: 2 },
        { name: "Заказ материалов", bp: 1 },
        { name: "Смена внешности 2", bp: 2 },
        { name: "Золотая рыбка", bp: 5 },
        { name: "Почта 10", bp: 1 },
        { name: "Платеж по лизингу", bp: 1 }
    ],
    pair: [
        { name: "Гонка", bp: 1 },
        { name: "Трен. Комплекс 5", bp: 1 },
        { name: "Картинг", bp: 1 },
        { name: "Денс батл 3", bp: 2 },
        { name: "Армреслинг", bp: 1 },
        { name: "Мафия", bp: 3 }
    ],
    faction: [
        { name: "Аирдроп 2", bp: 4 },
        { name: "Граффити 7", bp: 1 },
        { name: "Контрабанда 5", bp: 2 },
        { name: "Хаммер с ВЗХ", bp: 3 },
        { name: "Посадить траву в теплице", bp: 4 },
        { name: "Запустить переработку обезбола", bp: 4 },
        { name: "Капт", bp: 1 },
        { name: "Бизвар 5", bp: 2 },
        { name: "Медкарты EMS 5", bp: 2 },
        { name: "Вызовы EMS 15", bp: 2 },
        { name: "Объявления WN 40", bp: 2 },
        { name: "Зелёная строка WN", bp: 2 },
        { name: "Ограбления домов 15", bp: 2 },
        { name: "Коды 5", bp: 2 },
        { name: "Регистрация авто 2", bp: 1 },
        { name: "Арест", bp: 1 },
        { name: "Выкуп с КПЗ 2", bp: 2 }
    ]
}